Revit 2024 API
FabricationAncillaryUsage.Type Property
 Fabrication ancillary type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public FabricationAncillaryType Type { get; }
Visual Basic
Public ReadOnly Property Type As FabricationAncillaryType
	Get
Visual C++
public:
property FabricationAncillaryType Type {
	FabricationAncillaryType get ();
}
See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace